"""

Группа 1594
Вовод Борис

Задание:
Написать свой модуль utils и перенести в него функцию currency_rates() из предыдущего задания.
Создать скрипт, в котором импортировать этот модуль и выполнить несколько вызовов функции currency_rates().
Убедиться, что ничего лишнего не происходит.

Комментарий:
Тело функции находится в файле Vovod_Boris_task_4.py

"""

import Vovod_Boris_task_4

print(Vovod_Boris_task_4.currency_rates("USD"))
